;; http://d.hatena.ne.jp/khiker/20100721/doya
;;(defun doya-show ()
;;  (interactive)
;;  (let ((doya-faces '("						 ＿＿＿	 まぁ確かに・・・
;;    				／⌒  '' ⌒＼
;;    			  ／（ ● ) (● )＼				Emacsを立ち上げたのはお前
;;    			／::⌒	,	 ゝ⌒::＼	 (⌒)
;;    			|		`ｰ=-'	  |	   ﾉ~.ﾚ-r┐､
;;    			＼				 ／	  ノ  |.| |
;;.		  ,	 ⌒ ´	＼	   ￣	´ !〈￣｀- Lλ_ﾚﾚ
;;    	/	 __		  ヽ		|  ￣｀ー‐-‐‐´
;;.	   〃 ,. --ミ		 ヽ		i	|/ハ ／
;;      ji／	  ￣｀			ヽ	|\n"
;; 
;;    				  "						 ＿＿＿
;;    				／ノ '' ⌒＼
;;    			  ／（ ● ) (● )＼でも、この画面まで来れたのは俺のおかげ
;;    			／::⌒	 ,	 ゝ⌒::＼
;;    			|		ﾄ==ｨ'	  |
;;    _,rｰく´＼	＼,--､	  `ー'	  ／
;;. ,-く ヽ.＼ ヽ Y´	 ／	  ー	´ !｀ｰ-､
;;  {	 -!	 l _｣_ﾉ‐′/ ヽ			   |	∧
;;. ヽ  ﾞｰ'´ ヽ	  /		ヽ		  i	 |/ハ
;;  ｀ゝ、	ﾉ  ノ		  ヽ	 |\n"
;; 
;; 
;;    				  "						 ＿＿＿
;;    				／ヽ ''ノ＼
;;    			  ／（ ● ) (● )＼
;;    			／::⌒	  ､＿ゝ⌒::＼	(⌒)		  だろっ？
;;    			|		  -		  |	  ﾉ ~.ﾚ-r┐､
;;    			＼				 ／	 ノ_  |.| |
;;.		  ,	 ⌒ ´	＼	   ￣	´ !〈￣  ｀-Lλ_ﾚﾚ
;;    	/	 __		  ヽ		|  ￣｀ー‐-‐‐´
;;.	   〃 ,. --ミ		 ヽ		i	 |/ハ  ／
;;      ji／	  ￣｀			ヽ	|\n"
;; 
;; 
;;    				  "															＿＿＿_
;;      .												  ／_ノ	  ヽ､_＼
;;    											  oﾟ(（○)	  (（○）)ﾟo   ,. -- ､
;;    										   ／::::::⌒（__人__）⌒::::::	 /		__,＞─ ､
;;    										   |		  |r┬-|		/				   ヽ
;;    										   |		  |	 |	 |		｛						|__
;;    										   |		  |	 |	 |		 ｝	  ＼			 ,丿  ヽ
;;    ＿＿＿,.-------､			.		  |			 |	|	|	   /	､  ｀┬----‐１		 }
;;（⌒		_,.--‐		  ｀ヽ		  .			|		   |  |	  |	  .／	   `￢.|		 l		ﾉヽ
;;  ` ー-ｧ'' / / r'⌒)		￣￣`ー‐--	 ＼			`ー'ｫ  /		､ !_/.ｌ		l	   /   ｝
;;    	  ＼＼＼_／		ノ＿＿＿			 `''ー			{			＼		   l	 /	  ,'
;;    		  ￣ `（＿,r'			  ￣`ー-､		 .	   ／ ＼		  ´｀ヽ.__,ノ	  /	   ﾉ
;;    										   ／		   ／		 ＼			ヽ､＼ __,ノ	 ／
;;    										／			／				￣ ヽ､_	   〉 ,!､__／
;;    									   /	＿	 く							  ￣
;;    									 ／ ／	  ＼  ＼
;;    								  ／ ／			 ＼	 ＼
;;    			  .				   ／ ／			  ／  ／
;;    						   ／  ／				 ゝ、  ヽ
;;    						／	／						 ￣
;;    					 ／	   /
;;    					r＿__ノ\n"
;; 
;; 
;; 
;;    			 "			／￣￣	＼
;;    	／ﾉ(  _ノ	＼
;;    	|  ⌒(（ ●）（●）				うぜえ！
;;    	.|		   （__人__）  /⌒l
;;    	 |			｀ ⌒´ﾉ  |`'''|
;;    	／ ⌒ヽ			}	|	|					   ＿＿＿_
;;     ／	  へ	＼	   }__/	 /						／	─	  —＼
;;  ／  ／  |			  ノ	ノ					   ／●））	   （（●＼ . ’,  ･   ぐぇあ
;;( _ ノ		 |			 ＼´			  ＿	 ／		  （__人__）’,∴＼ ,	’
;;    		 |				＼＿,, -‐ ''\"	  ￣￣ﾞ''—---└'´￣｀ヽ/	  >	 て
;;    		 .|												   ＿＿ ノ	／	 （
;;    		  ヽ					  ＿,, -‐ ''\"￣ヽ､￣	`ー'´	 ／	  ｒ'\"￣
;;    			 ＼				 , '´					 /			  .|
;;    				＼			(					  /				 |
;;    				   ＼		 ＼				   /\n"
;; 
;;))
;;    	ol)
;;    (dolist (i doya-faces)
;;      (setq ol (make-overlay (window-start) (point-max)))
;;      (setq i (propertize i 'face 'highlight))
;;      (unwind-protect
;;    	  (progn (overlay-put ol 'after-string i)
;;    			 (overlay-put ol 'invisible t)
;;    			 (redisplay)
;;    			 (sleep-for 1.5)
;;    			 (discard-input))
;;    	(delete-overlay ol)))))
;;(add-hook 'emacs-startup-hook 'doya-show t)
